#include <stdio.h>

int main()
{
	//------------------------------------------------------ 9
	for (int n = 12113, s = 0, k = 0; n != 0; n = n / 10)
	{
		k = n % 10;

		if (k > s)
			s  = k;
		// выводит самое больше число
	}
	//------------------------------------------------------ 10
	for (int n = 1232, s = 0, k = 0; n != 0; n = n / 10)
	{
		k = n % 10;
		s = s * 10 + k;
		//printf("%d ", s);
		// выводит число задом наперёд
	}
	//------------------------------------------------------ 11
	for (int k = 132213, m = 1; m <= k; k++, m = m * 2)
	{
		//printf("%d ", k - 1); // выводит результат степеней двойки до k
	}
	//--------------------------------------------------------12
	for (int n = 31233, s = 0, k = 0; n != 0; n = n / 10)
	{
		k = n % 10;
		s = s + k;
	//	printf("%d ", s); // сумма цифр числа n
	}
	//--------------------------------------------------------13
	for (int  s = 1, i = 0; i <= s; i++)
	{
		s = s * 2;
		printf("%d ", s);
		// выводит степени двойки
	}

	return 0;
}
